In [89]:
# Importe o pandas
import pandas as pd
dados = pd.read_csv(r"/home/youx/youxlab-treino-git/youxlab-treino-git/dados/venda-de-carros.csv")

In [90]:
# Crie uma Série com 3 estados diferentes
serie_Estado = pd.Series(['Mg', 'Rj', 'Sc'])

In [91]:
# Visualize os dados criados na Série
serie_Estado

0    Mg
1    Rj
2    Sc
dtype: object

In [92]:
# Crie uma Série com 3 tipos de fabricantes de carro
serie_Carros = pd.Series(['bmw', 'nissan', 'toyota'])
serie_Carros

0       bmw
1    nissan
2    toyota
dtype: object

In [93]:
# Crie um DataFrame combinando as duas Séries
dados_series = pd.concat ([serie_Carros, serie_Estado], axis=1)
dados_series

        0   1
0     bmw  Mg
1  nissan  Rj
2  toyota  Sc

In [94]:
# Importe o csv "venda-de-carros.csv" em visualize o DataFrame
import pandas as pd
dados = pd.read_csv(r"/home/youx/youxlab-treino-git/youxlab-treino-git/dados/venda-de-carros.csv")

In [95]:
# Verifique os diferentes tipos de dados do DataFrame
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [96]:
# Verifique as informações estatísticas do DataFrame usando .describe()
dados.describe()

       Quilometragem     Portas
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [97]:
# Liste mais informações sobre o DataFrame usando a função info()
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [98]:
# Liste o nome de todas as colunas do DataFrame
dados.columns

Index(['Fabricante', 'Cor', 'Quilometragem', 'Portas', 'Preco'], dtype='object')

In [99]:
# Exiba apenas as 5 primeiras linhas do DataFrame
dados.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [100]:
# Exiba as 5 últimas linhas do DataFrame
dados.tail()

  Fabricante     Cor  Quilometragem  Portas         Preco
5     Toyota   Verde          99213       4  R$ 14,500.00
6      Honda    Azul          45698       4  R$ 17,500.00
7      Honda    Azul          54738       4  R$ 27,000.00
8     Toyota  Branco          60000       4  R$ 26,250.00
9     Nissan  Branco          31600       4  R$ 19,700.00

In [101]:
# Utilize .loc para selecionar os dados da linha de índice 3 do DataFrame
dados.loc[3]

Fabricante                 BMW
Cor                      Preto
Quilometragem            11179
Portas                       5
Preco            R$ 122,000.00
Name: 3, dtype: object

In [102]:
# Utilize .iloc para exibir os dados que estão na 5° posição do DataFrame
dados.iloc[4]

Fabricante             Nissan
Cor                    Branco
Quilometragem          213095
Portas                      4
Preco            R$ 13,500.00
Name: 4, dtype: object

In [103]:
# Selecione a coluna Quilometragem
dados.iloc[4]['Quilometragem']

np.int64(213095)

In [104]:
# Calcule a média da coluna Quilometragem
dados['Quilometragem'].mean()

np.float64(78601.4)

In [105]:
# Liste os carros que possuem uma quilometragem maior que 100.000
carros = dados[dados['Quilometragem'] > 100000]
print(carros)

  Fabricante     Cor  Quilometragem  Portas         Preco
0     Toyota  Branco         150043       4  R$ 24,000.00
4     Nissan  Branco         213095       4  R$ 13,500.00

In [106]:
# Agrupa os dados por 'Fabricante' e calcula a média das colunas numérica
media = dados.groupby('Fabricante', ).mean(numeric_only=True)

print(media)

            Quilometragem  Portas
Fabricante
BMW          11179.000000    5.00
Honda        62778.333333    4.00
Nissan      122347.500000    4.00
Toyota       85451.250000    3.75